app/controllers/organizations_controller.rb

SELECT  `organizations`.* FROM `organizations` WHERE `organizations`.`deleted_at` IS NULL AND `organizations`.`id` = 2 LIMIT 1
---
  def show
    @organization = Organization.find_by id: params[:id]